###############################################################################
### 
### CLOCK for cdc
###
###############################################################################
## == EXAMPLE ==================================================================
## == Frequency 500Mhz =========================================================
# create_clock -name ACLK                 -period         2           {ACLK}
# set_clock_groups -asynchronous  -group {ACLK}
## =============================================================================
## == Please put your SDC in below =============================================
## =============================================================================
#create_clock            -name PHY_WRCK       [get_ports DFT_MIF_PHY_WRCK]     -period $period_osc


###############################################################################
### 
### RESET for cdc
###
###############################################################################
## == Example ========================================================================
#create_reset {CPUPORESETN}       -async  -type reset -sense low 
#create_reset {SYSRESETN}         -async  -type reset -sense low 
## ===================================================================================
## == Please put your SDC in below ===================================================
## ===================================================================================
create_reset  [get_ports I_A_RESETN] -async -type reset -sense low -name A_RESET_N
create_reset  [get_ports I_P_RESETN] -async -type reset -sense low -name P_RESET_N

###############################################################################
### 
### INPUT/OUTPUT Delay for cdc
###
###############################################################################
## ===============================================================================
## == Example ====================================================================
## ===============================================================================
## set_input_delay  0.1 ACLK                                   -clock ACLK
## set_input_delay  0.1 CM7_AHB3_MI0_HREADYP                   -clock ACLK

## set_output_delay 0.1 ERR_CM7_D0TCMECC_CORRECTABLE           -clock ACLK

## == Please put your SDC in below ===============================================
## ===============================================================================

 set_input_delay 0.0 -clock ACLK [get_ports I_A_RESETN]
 set_input_delay 0.0 -clock PCLK [get_ports I_P_RESETN] 
###############################################################################
### 
### BlackBox for cdc
###
###############################################################################
## == Example ================================================================================
## ===========================================================================================
## set_constraints_scope   -instance  u_CM7_SAFE
## 	define_attribute      -name          BB01_ACLK
## 
## 	set_clock_attribute   BB01_ACLK       -clocks       ACLK
## 
##   apply_attribute       BB01_ACLK       -objects      CLKIN
##   apply_attribute       BB01_ACLK       -objects      SYSRESETREQ
##   apply_attribute       BB01_ACLK       -objects      BID
##   apply_attribute       BB01_ACLK       -objects      BRESP
## 
## end_constraints_scope	
## ===========================================================================================
## == Please put yout SDC in below ===========================================================
## ===========================================================================================
